In [2]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [25]:
csv_file = "economic_freedom.csv"
freedom_data_df = pd.read_csv(csv_file)
freedom_data_df.head()

,FREEDOM ID,Country name,index year,overall score,property rights,government integrity,judicial effectiveness,tax burden,government spending,fiscal health,business freedom,labor freedom,monetary freedom,trade freedom,investment freedom,financial freedom
0,1,Afghanistan,2016,NaN,NaN,12.0,NaN,91.6,81.2,NaN,56.6,63.2,NaN,NaN,55.0,NaN
1,2,Albania,2016,65.9,35.0,33.0,NaN,87.8,75.0,NaN,67.6,51.5,81.7,87.6,70.0,70.0
2,3,Algeria,2016,50.1,25.0,36.0,NaN,81.0,59.4,NaN,62.1,48.2,68.1,60.8,30.0,30.0
3,4,Angola,2016,48.9,15.0,19.0,NaN,87.8,50.1,NaN,50.3,44.8,72.2,70.2,40.0,40.0
4,5,Argentina,2016,43.8,15.0,34.0,NaN,66.1,51.3,NaN,56.0,43.9,44.0,67.4,30.0,30.0

In [26]:
new_freedom_data = freedom_data_df[['FREEDOM ID','Country name','index year', 'overall score','business freedom','trade freedom','investment freedom','financial freedom']].copy()
new_freedom_data.head()

,FREEDOM ID,Country name,index year,overall score,business freedom,trade freedom,investment freedom,financial freedom
0,1,Afghanistan,2016,NaN,56.6,NaN,55.0,NaN
1,2,Albania,2016,65.9,67.6,87.6,70.0,70.0
2,3,Algeria,2016,50.1,62.1,60.8,30.0,30.0
3,4,Angola,2016,48.9,50.3,70.2,40.0,40.0
4,5,Argentina,2016,43.8,56.0,67.4,30.0,30.0

In [27]:
v2_freedom_data= new_freedom_data[pd.notnull(new_freedom_data['overall score'])]
v2_freedom_data.head()

,FREEDOM ID,Country name,index year,overall score,business freedom,trade freedom,investment freedom,financial freedom
1,2,Albania,2016,65.9,67.6,87.6,70.0,70.0
2,3,Algeria,2016,50.1,62.1,60.8,30.0,30.0
3,4,Angola,2016,48.9,50.3,70.2,40.0,40.0
4,5,Argentina,2016,43.8,56.0,67.4,30.0,30.0
5,6,Armenia,2016,67.0,77.5,85.6,80.0,70.0

In [28]:
csv2_file = "world_trade_banking.csv"
trading_data_df = pd.read_csv(csv2_file)
trading_data_df.head()

,TRADE ID,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,1,AUS,BOP,TOT,MLN_USD,A,1960,-723.71660,NaN
1,2,AUS,BOP,TOT,MLN_USD,A,1961,-31.26144,NaN
2,3,AUS,BOP,TOT,MLN_USD,A,1962,-182.69510,NaN
3,4,AUS,BOP,TOT,MLN_USD,A,1963,-31.43871,NaN
4,5,AUS,BOP,TOT,MLN_USD,A,1964,-301.52540,NaN

In [29]:
trading_data = trading_data_df[['TRADE ID','LOCATION','TIME','Value']].copy()
trading_data.head()

   TRADE ID LOCATION  TIME      Value
0         1      AUS  1960 -723.71660
1         2      AUS  1961  -31.26144
2         3      AUS  1962 -182.69510
3         4      AUS  1963  -31.43871
4         5      AUS  1964 -301.52540

In [30]:
csv3_file="countrycode.csv"
countrycode_df = pd.read_csv(csv3_file)
countrycode_df.head()

  LOCATION    country name
0      ABW           Aruba
1      AFG     Afghanistan
2      AGO          Angola
3      AIA        Anguilla
4      ALA   Åland Islands

In [31]:
new_trading_data = pd.merge(trading_data,countrycode_df, on="LOCATION")
new_trading_data.head()

   TRADE ID LOCATION  TIME      Value country name
0         1      AUS  1960 -723.71660    Australia
1         2      AUS  1961  -31.26144    Australia
2         3      AUS  1962 -182.69510    Australia
3         4      AUS  1963  -31.43871    Australia
4         5      AUS  1964 -301.52540    Australia

In [34]:
rds_connection_string = "postgres:postgres@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')